performance.yml
config:
  target: "https://api.todoist.com"
  phases:
    - duration: 10
      arrivalRate: 3
      name: "Phase 1"
  variables:
    TASKURL:
      - "/rest/v1/tasks"
  defaults:
    headers:
      Authorization: Bearer {{ $processEnvironment.TOKEN }}
      Content-type: application/json
  processor: "./variables.js"
scenarios:
  - name: "Create a task, get a task, get active tasks, update a task, close a task, reopen a task and delete a task."
    flow:
      - function: "generateRandomData"
      - post:
          url: "{{ TASKURL }}"
          json:
            content: "{{ randomContent }}"
            due_string: "{{ randomDueString }}"
          capture:
            json: "$.id"
            as: "idTask"
      - log: "Creating task: Task ID {{ idTask }}"
      - get:
          url: "{{ TASKURL }}/{{ idTask }}"
      - log: "Getting a task: Task ID {{ idTask }}"
      - get:
          url: "{{ TASKURL }}"
      - log: "Getting active tasks"
      - post:
          url: "{{ TASKURL }}/{{ idTask }}"
          json:
            content: "{{ randomContent }}"
            due_string: "{{ randomDueString }}"
      - log: "Updating task: Task ID {{ idTask }}"
      - post:
          url: "{{ TASKURL }}/{{ idTask }}/close"
      - log: "Closing a task: Task ID {{ idTask }}"
      - post:
          url: "{{ TASKURL }}/{{ idTask }}/reopen"
      - log: "Reopening a task: Task ID {{ idTask }}"
      - delete:
          url: "{{ TASKURL }}/{{ idTask }}"
      - log: "Deleting a task: Task ID {{ idTask }}"